package com.avandy.dataset.generator;

import com.avandy.dataset.util.Randomizer;

public class Data {
    // Men
    public String getManName() {
        return menNames[Randomizer.getRandomInt(menNames.length)];
    }

    public String getManSurname() {
        return menSurnames[Randomizer.getRandomInt(menSurnames.length)];
    }

    public String getManNameAndSurname() {
        return getManName() + " " + getManSurname();
    }

    private final String[] menNames = {"Александр", "Максим", "Михаил", "Артём", "Даниил", "Иван", "Дмитрий", "Кирилл",
            "Андрей", "Матвей", "Егор", "Илья", "Марк", "Тимофей", "Роман", "Никита", "Алексей", "Лев", "Владимир",
            "Фёдор", "Ярослав", "Константин", "Сергей", "Степан", "Николай", "Георгий", "Владислав", "Павел", "Арсений",
            "Глеб", "Мирон", "Григорий", "Давид", "Макар", "Денис", "Семён", "Евгений", "Платон", "Савелий", "Артемий",
            "Виктор", "Леонид", "Пётр", "Руслан", "Богдан", "Игорь", "Юрий", "Василий", "Антон", "Захар", "Олег",
            "Демид", "Артур", "Вячеслав", "Елисей", "Всеволод", "Вадим", "Герман", "Святослав", "Филипп", "Дамир",
            "Тихон", "Борис", "Мирослав", "Станислав", "Гордей", "Родион", "Ян", "Серафим", "Валерий", "Демьян",
            "Анатолий", "Яков", "Арсен", "Марат", "Виталий", "Эрик", "Назар", "Альберт", "Мартин", "Ростислав",
            "Игнат", "Аркадий", "Рустам", "Клим", "Яромир", "Добрыня", "Аким", "Эльдар", "Ефим", "Феликс", "Эдуард",
            "Архип", "Булат", "Геннадий", "Гавриил", "Кузьма", "Прохор", "Тимур"
    };

    private final String[] menSurnames = {"Смирнов", "Иванов", "Кузнецов", "Соколов", "Попов", "Лебедев", "Козлов",
            "Новиков", "Морозов", "Петров", "Волков", "Соловьёв", "Васильев", "Зайцев", "Павлов", "Семёнов", "Голубев",
            "Виноградов", "Богданов", "Воробьёв", "Фёдоров", "Михайлов", "Беляев", "Тарасов", "Белов", "Комаров",
            "Орлов", "Киселёв", "Макаров", "Андреев", "Ковалёв", "Ильин", "Гусев", "Титов", "Кузьмин", "Кудрявцев",
            "Баранов", "Куликов", "Алексеев", "Степанов", "Яковлев", "Сорокин", "Сергеев", "Романов", "Захаров",
            "Борисов", "Королёв", "Герасимов", "Пономарёв", "Григорьев", "Лазарев", "Медведев", "Ершов", "Никитин",
            "Соболев", "Рябов", "Поляков", "Цветков", "Данилов", "Жуков", "Фролов", "Журавлёв", "Николаев", "Крылов",
            "Максимов", "Сидоров", "Осипов", "Белоусов", "Федотов", "Дорофеев", "Егоров", "Матвеев", "Бобров",
            "Дмитриев", "Калинин", "Анисимов", "Петухов", "Антонов", "Тимофеев", "Никифоров", "Веселов", "Филиппов",
            "Марков", "Большаков", "Суханов", "Миронов", "Ширяев", "Александров", "Коновалов", "Шестаков", "Казаков",
            "Ефимов", "Денисов", "Громов", "Фомин", "Давыдов", "Мельников", "Щербаков", "Блинов", "Колесников",
            "Карпов", "Афанасьев", "Власов", "Маслов", "Исаков", "Тихонов", "Аксёнов", "Гаврилов", "Родионов",
            "Котов", "Горбунов", "Кудряшов", "Быков", "Зуев", "Третьяков", "Савельев", "Панов", "Рыбаков", "Суворов",
            "Абрамов", "Воронов", "Мухин", "Архипов", "Трофимов", "Мартынов", "Емельянов", "Горшков", "Чернов",
            "Овчинников", "Селезнёв", "Панфилов", "Копылов", "Михеев", "Галкин", "Назаров", "Лобанов", "Лукин",
            "Беляков", "Потапов", "Некрасов", "Хохлов", "Жданов", "Наумов", "Шилов", "Воронцов", "Ермаков", "Дроздов",
            "Игнатьев", "Савин", "Логинов", "Сафонов", "Капустин", "Кириллов", "Моисеев", "Елисеев", "Кошелев",
            "Костин", "Горбачёв", "Орехов", "Ефремов", "Исаев", "Евдокимов", "Калашников", "Кабанов", "Носков",
            "Юдин", "Кулагин", "Лапин", "Прохоров", "Нестеров", "Харитонов", "Агафонов", "Муравьёв", "Ларионов",
            "Федосеев", "Зимин", "Пахомов", "Шубин", "Игнатов", "Филатов", "Крюков", "Рогов", "Кулаков", "Терентьев",
            "Молчанов", "Владимиров", "Артемьев", "Гурьев", "Зиновьев", "Гришин", "Кононов", "Дементьев", "Ситников",
            "Симонов", "Мишин", "Фадеев", "Комиссаров", "Мамонтов", "Носов", "Гуляев", "Шаров", "Устинов", "Вишняков",
            "Евсеев", "Лаврентьев", "Брагин", "Константинов", "Корнилов", "Авдеев", "Зыков", "Бирюков", "Шарапов",
            "Никонов", "Щукин", "Дьячков", "Одинцов", "Сазонов", "Якушев", "Красильников", "Гордеев", "Самойлов",
            "Князев", "Беспалов", "Уваров", "Шашков", "Бобылёв", "Доронин", "Белозёров", "Рожков", "Самсонов",
            "Мясников", "Лихачёв", "Буров", "Сысоев", "Фомичёв", "Русаков", "Стрелков", "Гущин", "Тетерин", "Колобов",
            "Субботин", "Фокин", "Блохин", "Селиверстов", "Пестов", "Кондратьев", "Силин", "Меркушев", "Лыткин", "Туров"
    };

    // Women
    public String getWomanName() {
        return womenNames[Randomizer.getRandomInt(womenNames.length)];
    }

    public String getSurname() {
        return menSurnames[Randomizer.getRandomInt(menSurnames.length)] + "а";
    }

    public String getWomenNameAndSurname() {
        return getWomanName() + " " + getSurname();
    }

    private final String[] womenNames = {"София", "Мария", "Анна", "Виктория", "Алиса", "Анастасия", "Полина",
            "Александра", "Дарья", "Варвара", "Екатерина", "Ксения", "Арина", "Ева", "Вероника", "Василиса",
            "Милана", "Валерия", "Ульяна", "Кира", "Вера", "Таисия", "Софья", "Маргарита", "Алёна", "Алина",
            "Мирослава", "Кристина", "Диана", "Ольга", "Юлия", "Есения", "Ангелина", "Татьяна", "Стефания",
            "Евгения", "Эмилия", "Яна", "Майя", "Злата", "Ника", "Ирина", "Елена", "Амелия", "Агата", "Аделина",
            "Надежда", "Дарина", "Элина", "Марина", "Ярослава", "Нина", "Светлана", "Милена", "Лидия", "Любовь",
            "Зоя", "Агния", "Наталья", "Олеся", "Антонина", "Карина", "Лилия", "Серафима", "Марьяна", "Каролина",
            "Марианна", "Мира", "Марта", "Раяна", "Аврора", "Владислава", "Мила", "Сабина", "Валентина", "Евдокия",
            "Эмма", "Эвелина", "Евангелина", "Пелагея", "Тамара", "Альбина", "Виолетта", "Лада", "Анфиса", "Анжелика",
            "Алеся", "Юлиана", "Регина", "Алла", "Лия", "Людмила", "Василина", "Влада", "Нелли", "Дария", "Алсу",
            "Виталина", "Дина", "Изабелла", "Луиза", "Марфа", "Катерина", "Снежана", "Ася", "Лина", "Соня",
            "Аида", "Аксинья", "Галина", "Глафира", "Рада", "Элеонора", "Елизавета"
    };

    // Random human
    public String getRandomHuman() {
        return Randomizer.getRandomBoolean() ? getManNameAndSurname() : getWomenNameAndSurname();
    }

    // Color
    public String getColor() {
        return color[Randomizer.getRandomInt(color.length)];
    }

    private final String[] color = {
            "Коричневый", "Красный", "Синий", "Белый", "Чёрный", "Жёлтый", "Оранжевый",
            "Голубой", "Фиолетовый", "Розовый", "Зелёный", "Серый", "Бирюзовый", "Салатовый"
    };

    // Car
    public String getCar() {
        return car[Randomizer.getRandomInt(car.length)];
    }

    private final String[] car = {
            "Toyota", "Volkswagen", "Ford", "Honda", "Nissan", "Hyundai", "Chevrolet", "KIA", "Renault", "Mercedes",
            "Peugeot", "BMW", "Audi", "Fiat", "Maruti", "Mazda", "Suzuki", "Jeep", "Changan", "Buick", "Skoda",
            "Wuling", "Opel", "Geely", "Subaru", "Mitsubishi", "Citroen", "Dongfeng", "Daihatsu", "Baojun", "Haval",
            "Ram", "GMC", "Dodge", "Dacia", "Lexus", "Isuzu", "Volvo", "GACGonow", "Chery", "SEAT", "BAIC", "JAC",
            "LandRover", "Foton", "BYD", "MINI", "Roewe", "Cadillac", "LADA"
    };

    // Country
    public String getCountry() {
        return country[Randomizer.getRandomInt(country.length)];
    }

    private final String[] country = {
            "Китай", "США", "Индия", "Япония", "Германия", "Россия", "Индонезия", "Бразилия", "Франция",
            "Великобритания", "Италия", "Мексика", "Турция", "Республика Корея", "Канада", "Испания",
            "Саудовская Аравия", "Китайская Республика", "Австралия", "Иран", "Польша", "Египет", "Таиланд",
            "Пакистан", "Нигерия", "Вьетнам", "Нидерланды", "Бангладеш", "Аргентина", "Филиппины", "Малайзия",
            "Колумбия", "ЮАР", "ОАЭ", "Бельгия", "Румыния", "Швейцария", "Сингапур", "Швеция", "Украина*", "Чили",
            "Казахстан", "Алжир", "Ирландия", "Австрия", "Гонконг (КНР)", "Чехия", "Перу", "Ирак", "Норвегия",
            "Израиль", "Дания", "Португалия", "Венгрия", "Греция", "Шри-Ланка", "Марокко", "Эфиопия", "Финляндия",
            "Узбекистан", "Кения", "Катар", "Мьянма", "Новая Зеландия", "Кувейт", "Доминиканская Республика",
            "Ангола", "Эквадор", "Белоруссия", "Гана", "Судан", "Болгария", "Словакия", "Танзания", "Оман",
            "Гватемала", "Ливия", "Азербайджан", "Кот-д’Ивуар", "Сербия", "Венесуэла", "Панама", "Тунис", "Хорватия",
            "Непал", "Коста-Рика", "Пуэрто-Рико(США)", "Литва", "Уганда", "ДРК", "Иордания", "Камерун", "Туркмения",
            "Боливия", "Парагвай", "Словения", "Афганистан", "Люксембург", "Уругвай", "Бахрейн", "Камбоджа", "Ливан",
            "Замбия", "Латвия", "Сенегал", "Лаос", "Грузия", "Сальвадор", "Гондурас", "Йемен", "Зимбабве", "Эстония",
            "Босния и Герцеговина", "Буркина-Фасо", "Мали", "Макао (КНР)", "Бенин", "Мадагаскар", "Албания", "Армения",
            "Мозамбик", "Монголия", "Никарагуа", "Ботсвана", "Таджикистан", "Папуа — Новая Гвинея", "Молдавия",
            "Гвинея", "Кипр", "Тринидад и Тобаго", "Северная Македония", "Гаити", "Габон", "Киргизия", "Руанда",
            "Нигер", "Малави", "Государство Палестина", "Ямайка", "Бруней", "Маврикий", "Чад", "Мавритания",
            "Экваториальная Гвинея", "Намибия", "Мальта", "Республика Косово", "Исландия", "Сомали", "Республика Конго",
            "Того", "Гайана", "Сьерра-Леоне", "Черногория", "Багамские Острова", "Южный Судан", "Эсватини", "Фиджи",
            "Мальдивы", "Суринам", "Бурунди", "Бутан", "Либерия", "Эритрея", "Гамбия", "Джибути", "Восточный Тимор",
            "Лесото", "ЦАР", "Барбадос", "Гвинея-Бисау", "Андорра", "Кабо-Верде", "Аруба (Нидерланды)",
            "Сейшельские Острова", "Коморы", "Белиз", "Сент-Люсия", "Сан-Марино", "Антигуа и Барбуда", "Гренада",
            "Соломоновы Острова", "Сент-Винсент и Гренадины", "Сент-Китс и Невис", "Самоа", "Сан-Томе и Принсипи",
            "Вануату", "Доминика", "Тонга", "Микронезия", "Кирибати", "Маршалловы Острова", "Палау", "Науру",
            "Тувалу", "Бермуды (Брит.)", "Острова Кайман (Брит.)", "Кюрасао (Нидерланды)",
            "Синт-Мартен(Франция)", "Теркс и Кайкос (Брит.)",
    };

}