package list;

import util.Randomizer;

public class PeopleNames {
    private final Randomizer random = new Randomizer();

    private final String[] menNames = {"Александр", "Максим", "Михаил", "Артём", "Даниил", "Иван", "Дмитрий", "Кирилл",
            "Андрей", "Матвей", "Егор", "Илья", "Марк", "Тимофей", "Роман", "Никита", "Алексей", "Лев", "Владимир",
            "Фёдор", "Ярослав", "Константин", "Сергей", "Степан", "Николай", "Георгий", "Владислав", "Павел", "Арсений",
            "Глеб", "Мирон", "Григорий", "Давид", "Макар", "Денис", "Семён", "Евгений", "Платон", "Савелий", "Артемий",
            "Виктор", "Леонид", "Пётр", "Руслан", "Богдан", "Игорь", "Юрий", "Василий", "Антон", "Захар", "Олег",
            "Демид", "Артур", "Вячеслав", "Елисей", "Всеволод", "Вадим", "Герман", "Святослав", "Филипп", "Дамир",
            "Тихон", "Борис", "Мирослав", "Станислав", "Гордей", "Родион", "Ян", "Серафим", "Валерий", "Демьян",
            "Анатолий", "Яков", "Арсен", "Марат", "Виталий", "Эрик", "Назар", "Альберт", "Мартин", "Ростислав",
            "Игнат", "Аркадий", "Рустам", "Клим", "Яромир", "Добрыня", "Аким", "Эльдар", "Ефим", "Феликс", "Эдуард",
            "Архип", "Булат", "Геннадий", "Гавриил", "Кузьма", "Прохор", "Тимур"
    };

    private final String[] menSurnames = {"Алкашов", "Бухалов", "Спиртохлёбов", "Люлякебабов", "Шашлыков", "Колбасов",
            "Пловоедов", "Водосчётов", "Электров", "Чепухов", "Задолбалов", "Наливаев", "Отдыхаев",
            "Свистоплясов", "Дискотеков", "Говноедов", "Громков", "Долбаёбов", "Ебалов", "Дристоедов", "Теплотрахов",
            "Дебилов", "Членоногов", "Лакалов"
    };

    private final String[] womenNames = {"София", "Мария", "Анна", "Виктория", "Алиса", "Анастасия", "Полина",
            "Александра", "Дарья", "Варвара", "Екатерина", "Ксения", "Арина", "Ева", "Вероника", "Василиса",
            "Милана", "Валерия", "Ульяна", "Кира", "Вера", "Таисия", "Софья", "Маргарита", "Алёна", "Алина",
            "Мирослава", "Кристина", "Диана", "Ольга", "Юлия", "Есения", "Ангелина", "Татьяна", "Стефания",
            "Евгения", "Эмилия", "Яна", "Майя", "Злата", "Ника", "Ирина", "Елена", "Амелия", "Агата", "Аделина",
            "Надежда", "Дарина", "Элина", "Марина", "Ярослава", "Нина", "Светлана", "Милена", "Лидия", "Любовь",
            "Зоя", "Агния", "Наталья", "Олеся", "Антонина", "Карина", "Лилия", "Серафима", "Марьяна", "Каролина",
            "Марианна", "Мира", "Марта", "Раяна", "Аврора", "Владислава", "Мила", "Сабина", "Валентина", "Евдокия",
            "Эмма", "Эвелина", "Евангелина", "Пелагея", "Тамара", "Альбина", "Виолетта", "Лада", "Анфиса", "Анжелика",
            "Алеся", "Юлиана", "Регина", "Алла", "Лия", "Людмила", "Василина", "Влада", "Нелли", "Дария", "Алсу",
            "Виталина", "Дина", "Изабелла", "Луиза", "Марфа", "Катерина", "Снежана", "Ася", "Лина", "Соня",
            "Аида", "Аксинья", "Галина", "Глафира", "Рада", "Элеонора", "Елизавета"
    };

    public String getRandomManName(){
        return menNames[random.getRandomInt(menNames.length)];
    }

    public String getRandomWomanName(){
        return womenNames[random.getRandomInt(womenNames.length)];
    }

    public String getManSurname(){
        return menSurnames[random.getRandomInt(menSurnames.length)];
    }

    public String getWomanSurname(){
        return menSurnames[random.getRandomInt(menSurnames.length)] + "а";
    }
}
